// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

// int NewRandom(){
//     int number = new Random().Next(100, 1000);
//     return number;
// }
// int GetSecondDigit(int random)
//     {
//         return (random / 10) % 10;
//     }
// int random = NewRandom();
// int mNumber = GetSecondDigit(random);
// Console.WriteLine($"{random} -> {mNumber}");
